 [BUG] 캐릭터 불사 현상

버그 요약: 체력이 적은 상태로 줄넘기 패턴에 피격되었으나 캐릭터가 사망하지 않는 현상

💻 테스트 환경 (Environment)

OS/버전: Windows 11

대상 버전: L.260212.2_5

📋 재현 단계 (Steps to Reproduce)

1. 헤니르 : 데빌 오브 카오스 진입

2. 매몰된 성전 1페이즈 심연의 숭배자 (헤니르) 패턴 진입

3. 패턴 회피 실패 및 피격중 상단 또는 하단 안개구역으로 이동

4. 맵중앙으로 전이

5. 체력이 없는상태로 레이저 피격

6. 피격되었으나 2 ~ 4회 피격된 상황에서도 생존

✅ 기대 결과 (Expected Result)

패턴에 피격시 체력이 약 30% 정도 감소, 체력 0% 달성시 캐릭터의 사망

❌ 실제 결과 (Actual Result)

패턴에 피격되었으나 죽지않고 견뎌짐

📸 에비던스 (Evidence)




🚨 위험도 판정 (Severity & Priority)

심각도 (Severity): Major

우선순위 (Priority): High
