[TC-ID-04]서펜티움 레이드 서펜티움 타워 2페이즈 패턴

Status: 🟢 Pass

개요 (Summary)

서펜티움 타워 싱글모드 패턴 진입->진행->파훼(실패) 테스트

사전 조건 (Pre-conditions)

서펜티움 지역 해금캐릭터 전투력 1,300만 이상 캐릭터


테스트 단계 (Test Steps)
| Step | Action | Test Data | Expected Result | Actual Result |
|:---:|---|---|---|:---:|
| 1 | [싱글]모드 2페이즈 진입 | 1페이즈 클리어 시 | 1페이즈 보스의 체력이 0% 도달시 컷신이후 페이즈 변경 | 🟢 Pass |
| 2 | 2페이즈 패턴 진입 | HP 150줄 달성 시 | 보스가 맵 뒤로 이동후 패턴시작 | 🟢 Pass |
| 3 | 안전구역 활성화 패턴 | - | 캐릭터상단에 빨강,초록,노랑 세종류중 한가지의 색상 문양 출현 | 🟢 Pass |
| 4 | 동일한 색상의 안전구역 충전봉 2개 상호작용 | 캐릭터 상단 머리색 확인 | 2개 상호작용시 안전구역 활성화 | 🟢 Pass |
| 5 | 패턴 파훼까지 대기 | 안전구역 활성화 상태 | 보스의 불빛이 점멸후 스캔시작, 종료 후 보스가 필드로 이동 | 🟢 Pass |
| 6 | 안전구역 활성화 실패 | - | 보스 스캔 종료후 맵전체에 즉사데미지, 패턴 실패 판정 | 🟢 Pass |
| 7 | 안전구역 순차적으로 이동하는 패턴 | HP 150줄 달성 시 | 보스가 맵 뒤로 이동후 랜덤한 순서로 빨강 초록 노랑 표시 | 🟢 Pass |
| 8 | 보스가 제시한 순서대로 안전구역 이동 | - | 종료 후 보스가 필드로 이동 | 🟢 Pass |
| 9 | 세가지 안전구역중 한 구간 이상 안전구역 대기 실패 | - | 보스 스캔 종료후 맵전체에 즉사데미지, 패턴 실패 판정 | 🟢 Pass |
| 10 | [공통]안전구역 바깥위치 대기 | - | 보스 스캔시 안전구역 바깥에 존재하면 피격음 출력 | 🟢 Pass |
| 11 | [공통]패턴 파훼 실패시 사망 | 부활 횟수가 남아있을때 | 부활 횟수 3회까지 부활가능| 🟢 Pass |
| 12 | [공통]키보드 X 입력 | 부활 카운트 다운중 | X버튼입력으로 부활이 취소됨 | 🟢 Pass |

일반모드의경우 패턴 파훼중 스캔에 인식된 유저가 바닥으로 낙사하여 패턴실패를 넘길수 있습니다.
동일하게 진행 할경우 싱글모드이기때문에 패턴 파훼 = 낙사로 패턴넘기기 가 동일한 결과가 발생됩니다.
안전구역 활성화 패턴의경우 일반모드 6인이 서로 2인이 짝지어지며 충전봉 하나씩 활성화 하여 패턴을 넘깁니다
[싱글]모드에서도 유저혼자 하기 편하게 충전봉 하나는 활성화가 된 상태로 시작하면 더욱 편의성이 좋을것 같습니다.
